In [23]:
import pandas as pd
import numpy as np

# INTRODUCTION TO PANDAS DATA STRUCTURES

## Series

In [3]:
obj = pd.Series([4,7,-5,3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [5]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [6]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [9]:
obj2 = pd.Series([4,7,-5,3],index=['a','b','c','d'])
obj2

a    4
b    7
c   -5
d    3
dtype: int64

In [11]:
obj2.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [13]:
obj2['a']

4

In [14]:
obj2[['a','b','d']]

a    4
b    7
d    3
dtype: int64

In [15]:
obj2[obj2 > 0]

a    4
b    7
d    3
dtype: int64

In [16]:
obj * 2

0     8
1    14
2   -10
3     6
dtype: int64

In [19]:
'b' in obj2

True

In [20]:
sdata = {'Ohio':35000,'Texas':71000,'Oregon':16000,'Utah':5000}

In [23]:
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [32]:
states = ['Ohio','Texas','Oregon','California']

In [33]:
obj4 = pd.Series(sdata,index=states)
obj4

Ohio          35000.0
Texas         71000.0
Oregon        16000.0
California        NaN
dtype: float64

In [34]:
pd.isnull(obj4)

Ohio          False
Texas         False
Oregon        False
California     True
dtype: bool

In [35]:
obj4.notnull()

Ohio           True
Texas          True
Oregon         True
California    False
dtype: bool

In [36]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [39]:
obj4.name = 'Population'
obj4.index.name = 'state'
obj4

state
Ohio          35000.0
Texas         71000.0
Oregon        16000.0
California        NaN
Name: Population, dtype: float64

In [40]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [41]:
obj.index = ['Bob','Steve','Jeff','Ryan']
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

# DataFrame

In [2]:
data = {'state':['Ohio','Ohio','Ohio','Nevada','Nevada','Nevada'],
       'year': [2000,2001,2002,2000,2001,2002],
       'pop':[1.5,1.7,3.6,2.4,2.9,3.2]}

In [3]:
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2000  2.4
4  Nevada  2001  2.9
5  Nevada  2002  3.2

In [4]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2000  2.4
4  Nevada  2001  2.9

In [5]:
pd.DataFrame(data, columns=['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2000  Nevada  2.4
4  2001  Nevada  2.9
5  2002  Nevada  3.2

In [13]:
pd.DataFrame(data,columns=['year','state','pop'],index=['one','two','three','four','five','six'])

       year   state  pop
one    2000    Ohio  1.5
two    2001    Ohio  1.7
three  2002    Ohio  3.6
four   2000  Nevada  2.4
five   2001  Nevada  2.9
six    2002  Nevada  3.2

In [14]:
frame.columns

Index(['state', 'year', 'pop'], dtype='object')

In [15]:
frame['state']

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [17]:
frame.state

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [20]:
frame.loc[0]

state    Ohio
year     2000
pop       1.5
Name: 0, dtype: object

In [22]:
frame['debt'] = 16.5
frame

    state  year  pop  debt
0    Ohio  2000  1.5  16.5
1    Ohio  2001  1.7  16.5
2    Ohio  2002  3.6  16.5
3  Nevada  2000  2.4  16.5
4  Nevada  2001  2.9  16.5
5  Nevada  2002  3.2  16.5

In [25]:
frame['debt'] = np.arange(6.)
frame

    state  year  pop  debt
0    Ohio  2000  1.5   0.0
1    Ohio  2001  1.7   1.0
2    Ohio  2002  3.6   2.0
3  Nevada  2000  2.4   3.0
4  Nevada  2001  2.9   4.0
5  Nevada  2002  3.2   5.0

In [26]:
val = pd.Series([-1.2,-1.5,-1.7], index=[3,4,5])
val

3   -1.2
4   -1.5
5   -1.7
dtype: float64

In [28]:
frame['debt'] = val
frame

    state  year  pop  debt
0    Ohio  2000  1.5   NaN
1    Ohio  2001  1.7   NaN
2    Ohio  2002  3.6   NaN
3  Nevada  2000  2.4  -1.2
4  Nevada  2001  2.9  -1.5
5  Nevada  2002  3.2  -1.7

In [29]:
frame['eastern'] = frame.state == 'Ohio'
frame

    state  year  pop  debt  eastern
0    Ohio  2000  1.5   NaN     True
1    Ohio  2001  1.7   NaN     True
2    Ohio  2002  3.6   NaN     True
3  Nevada  2000  2.4  -1.2    False
4  Nevada  2001  2.9  -1.5    False
5  Nevada  2002  3.2  -1.7    False

In [30]:
del frame['eastern']
frame

    state  year  pop  debt
0    Ohio  2000  1.5   NaN
1    Ohio  2001  1.7   NaN
2    Ohio  2002  3.6   NaN
3  Nevada  2000  2.4  -1.2
4  Nevada  2001  2.9  -1.5
5  Nevada  2002  3.2  -1.7

In [37]:
pop = {'Nevada' : {2001:2.4,2002:2.9},
      'Ohio': {2000: 1.5,2001: 1.7,2002: 3.6}}

In [38]:
frame2 = pd.DataFrame(pop)
frame2

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [39]:
frame2.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [ ]:
pdata = {'Ohio':frame['Ohio'][:-1]}

In [41]:
frame2['Ohio'][:-1]

2001    1.7
2002    3.6
Name: Ohio, dtype: float64

In [45]:
frame2.index.name = 'year'
frame2.columns.name = 'state'

In [46]:
frame2

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [54]:
frame2.values

array([[2.4, 1.7],
       [2.9, 3.6],
       [nan, 1.5]])

In [51]:
frame

    state  year  pop  debt
0    Ohio  2000  1.5   NaN
1    Ohio  2001  1.7   NaN
2    Ohio  2002  3.6   NaN
3  Nevada  2000  2.4  -1.2
4  Nevada  2001  2.9  -1.5
5  Nevada  2002  3.2  -1.7

In [52]:
frame.values

array([['Ohio', 2000, 1.5, nan],
       ['Ohio', 2001, 1.7, nan],
       ['Ohio', 2002, 3.6, nan],
       ['Nevada', 2000, 2.4, -1.2],
       ['Nevada', 2001, 2.9, -1.5],
       ['Nevada', 2002, 3.2, -1.7]], dtype=object)

# Index Objects